"""
3. Список гостей: если бы вы могли пригласить кого угодно (из живых или умерших)
на обед, то кого бы вы пригласили? Создайте список, включающий минимум трех людей,
которых вам хотелось бы пригласить на обед. Затем используйте этот список для вывода
пригласительного сообщения каждому участнику.
"""
list_ = ["adi","madi","fodi","bedi"]
print ("напишите куда хотели позвать :")
message = input()
print (list_[0]+" letsgo to " +message) 
print (list_[1]+" letsgo to "+message )
print (list_[2]+" letsgo to "+message ) 
print (list_[3]+" letsgo to "+message )